[Translation]
;#################
;Translated by: Malinthe Samarakoon | malinthe@gmail.com
;http://groups.google.com/group/sinhala-unicode
;#################

ThisLanguage=		සිංහල

Language=			භාෂාව

DockSettings=		ඩොක් සැකසුම්...
IconSettings=		අයිකන සැකසුම්...
AddItem=			අයිතමයක් එක් කරන්න
  ItemFile=			ගොනුවක්
  ItemPath=			මාර්ගයක්
  ItemSeparator=		වෙන්කරනයක්
  ItemDockSettings=	ඩොක් සැකසුම්
DeleteItem=			අයිතමයක් ඉවත්කරන්න
TakeScreenshot=		සැනිරුවක් ලබාගන්න


General=			සාමාන්‍ය
AutoRun=			ආරම්භයේදී ක්‍රියාත්මක කරන්න
HideLabels=			අයිකන නම් ක්‍රියාවිරහිත කරන්න
LockIcons=			අයිතම යතුරුලන්න
AutoHide=			ස්වයංක්‍රීය සැඟවුම


Icons=			අයිකන
Size=				ප්‍රමාණය
Quality=			තත්ත්වය
  QualityLow=		අඩු තත්ත්වය (වේගවත්)
  QualityMedium=		සාමාන්‍ය තත්ත්වය
  QualityHigh=		උසස් තත්ත්වය (මන්දගාමී)
Zoom=				විශාලනය
ZoomRange=			විශාලන පළල
ZoomTime=			විශාලන කාලය


Position=			ස්ථානය
Monitor=			මොනිටරය
  MonitorList=		මොනිටරය
Side=				තිර ස්ථානය
  SideTop=			ඉහළ
  SideBottom=		පහළ
  SideLeft=			වම
  SideRight=		දකුණ
Z-Order=			පෘෂ්ඨනය
  zTop=			සැමවිටම ඉහළින්
  zNormal=			සාමාන්‍ය

  zBottom=			සැමවිටම පහළින්
Offset=			පිටපැනුම


Style=			විලාසිතාව
Theme=			තේමාව
Opacity=			පාරදෘෂ්‍ය බව
SelectFont=			අකුරු රටාව


About=			විස්තර
Donate=			ආධාර
Updates=			යාවත්කාලනය
Forums=			සමූහය



Quit=				පිටවන්න
OK=				හරි
Cancel=			වැරදියි



Version=			නිපැයුම
ThankYou=			රොකට්ඩොක් භාවිතාකරන ඔබ සැමට තුති.<BR><BR>ඔබ මෙය අගය කරන්නේනම් ඔබගේ මිතුරන්ට දැනුම් දෙමින් සහය වන්න.:)<BR><BR>රසවිඳින්න!<BR>Punk මෘදුකාංග කණ්ඩායම

Folders=			බහාලුම්
DefaultFolder=		සම්මත බහාලුම
ChangeFolder=		බහාලුම වෙනස් කරන්න


Preview=			පූර්වදර්ශනය


DefaultIcon=		සම්මත අයිකනය


Properties=			සැකසුම්
Name=				නම
Target=			ඉලක්කය
FindTarget=			ඉලක්කය සොයන්න
StartIn=			ඇරඹිය යුතු
Arguments=			තර්කන
Run=				අරඹන්න
  RunNormal=		සාමාන්‍ය
  RunMaximized=		විශාලිත
  RunMinimized=		කුඩාකළ
Popup=			පැනනගින මෙනුව
ContextMenu=		විශේෂ කටයුතු පෙන්වන්න


FontOutlineColor=		රේඛා වර්ණය
FontShadowColor=		සෙවණැලි වර්ණය
FontOutlineOpacity=	රේඛා පාරදෘෂ්‍යතාව
FontShadowOpacity=	සෙවණැලි පාරදෘෂ්‍යතාව



;#################
;For Version 1.1.2
;#################

MouseActivate=		මවුසය මතින් පැනනගින්න
AutoHideTime=		ස්වයංක්‍රීය සැඟවුම් කාලය
AutoHideDelay=		ස්වයංක්‍රීය සැඟවුම් ප්‍රමාදය
UberIconFX=			ඌබර්අයිකන් ආචරණ



;#################
;For Version 1.2.0
;#################

ZoomFlat=			විශාලනය: පැතලි
VerticalOffset=		සිරස් පිටපැනුම
ItemBlank=			හිස් අයිකනය
Defaults=			සම්මත
Confirm=			තහවුරු කිරීම
ConfirmDefaults=		ඔබට රොකට්ඩොක් සම්මත සැකසුම් වලට පත්කිරීමට අවශ්‍යද@<BR>සටහන: මෙය ඔබගේ අයිකන වලට බලනොපායි.


;#################
;For Version 1.3.0
;#################

;NOTE: "ZoomFlat" was changed above... Please re-translate
;=========================================================

ManageWindows=		කවුළු ඩොක් එකට කුඩාකරන්න
ShowRunning=		ධාවනය වන වැඩසටහන් පෙන්වන්න
OpenRunning=		ධාවනය වන වැඩසටහන විවෘත කරන්න
UseINI=			සැකසුම් ජංගම INI ගොනුවක රඳවන්න (තනි-පරිශීලක)
GetMore=			තවත් ලබාගන්න
Behavior=			හැසිරීම
MouseActivateDelay=	පැනනැගීම් ප්‍රමාදය
IconActivationFX=		අයිකන අවධාන ආචරණය
None=				කිසිවක් නැත
Bounce=			පොලාපනින
ZoomOpaque=			විශාලන: පාරාන්ධ
HoverFX=			පාවීම් ආචරණය
ZoomBubble=			විශාලන: බුබුල
ZoomPlateau=		විශාලන: සානුව
OpenWindow=			කවුළුවක් විවෘතකරන්න
CloseWindow=		කවුළුව වසන්න
ItemRecycleBin=		අපද්‍රව්‍ය භාජනය
StateNormal=		සාමාන්‍ය අයිකනය
StateEmpty=			හිස් අපද්‍රව්‍ය භාජනය
StateFull=			පිරුණු අපද්‍රව්‍ය භාජනය

‍
;#################
;For Version 1.3.1
;#################

DebugInfo=			Debug තොරතුරු
ConfirmDebugInfo=		රොකට්ඩොග් Debug ගොනුවක් සැකසීමට සූදානම්...<BR><BR>පහත සඳහන් විස්තර එහි අඩංගු වේ:<BR>  * රොකට්ඩොක්  සැකසුම් (මාර්ග හා තර්කන)<BR>  * දැනට ධාවනය වන කටයුතු<BR>  * වැදගත් පද්ධති විස්තර
DisableMinAnimation=	කුඩාකිරීමේ සජීවීකරණ ක්‍රියාවිරහිත කරන්න
OpenRunningShort=		ධාවනය වන්නා විවෘත කරන්න
UseGlobal=			ගෝලීය සැකසුම භාවිතාකරන්න
Always=			සැමවිට
Never=			කිසිවිට එපා
Warnings=			අවවාද: <COUNT>
WarningINIWrite=		Settings.ini කියවීමට පමණි. ඔබගේ සැකසුම් සුරැකිය නොහැක.
